Revit 2026 API

# DuctFailures Properties

---

The BuiltInFailuresDuctFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CannotCreateGeometryForDuct | Cannot create geometry for flex duct. The flex duct is intersecting itself or the start and end are too close together. |
|  | FlexDuctLengthOutOfLimits | The flex duct length of [Length Value] exceeds the maximum specified length of [Maximum Flex Duct Length Value] |
|  | NoDuctFittingsInProject | There are no duct fittings defined in project. The default duct type for fittings will be set to none. |
|  | PartNotFoundDueToNoDuctConnectedError | "In order to find a matching part, the fitting has to be connected to a duct." |
|  | PartNotFoundDueToNoDuctConnectedWarning | "In order to find a matching part, the fitting has to be connected to a duct." |

#### Reference

BuiltInFailuresDuctFailures Class

Autodesk.Revit.DB Namespace